FundamentalsOfOperatingSystem/introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-01 Tue 13:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="looph0le" />
<link rel="stylesheet" href="https://sandyuraz.com/styles/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Introduction</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgae378df">1. Getting Started</a>
<ul>
<li><a href="#orgd50b78b">1.1. What Is An Operating System</a></li>
<li><a href="#org7f32150">1.2. Key Features Of An Operating System</a></li>
<li><a href="#org375cd09">1.3. More About Operating Systems</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgae378df" class="outline-2">
<h2 id="orgae378df"><span class="section-number-2">1</span> Getting Started</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd50b78b" class="outline-3">
<h3 id="orgd50b78b"><span class="section-number-3">1.1</span> What Is An Operating System</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A operating system is the software that manages the computer's hardware and provides a convenient and safe environment for running programs.
It acts as an interface between programs and the hardware resources that these programs access (like memory, hard disk and printer).
It is loaded into memory when a computer is booted and remains active as long as the machine is up.
</p>
</div>
</div>

<div id="outline-container-org7f32150" class="outline-3">
<h3 id="org7f32150"><span class="section-number-3">1.2</span> Key Features Of An Operating System</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>The operating System allocates memory for the program and load the program to the allocated memory.</li>

<li>It also loads the CPU registers with control information related to the programs. The registers maintain the memory locations where each segment of a program is stored.</li>

<li>The instructions provided in the program are executed by the CPU. The operating System keeps track the instructions that was last executed.
That enables it to resume a program if it had to be taken out of the CPU before it completed execution.</li>

<li>If the program needs to access hardware, it makes a call to the Operating System rather than attempts to do the job itself.
For instance, if the program needs to read a file on disk, the operating system directs the disk controller to open the file and make the data available to the program.</li>

<li>After the program has completed execution, the operating System cleans up the memory and registers and makes them available for the next</li>
</ul>
</div>
</div>

<div id="outline-container-org375cd09" class="outline-3">
<h3 id="org375cd09"><span class="section-number-3">1.3</span> More About Operating Systems</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Modern Operating Systems are multiprogramming, they allow multiple programs to be in memory.
</p>


<p>
An Operating System generally allows a program to run for small instant of time, save its current state and then load the next program in the queue.
The Operating System creates a process for each program and the control the switching of these processes.
</p>


<p>
An Operating System may process its task <i>serially</i> (Sequentially) or <i>concurrently</i> (several tasks simultaneously).
This means that the resources of the computer system may be dedicated to a single program until its completion or they may be allocated among several programs
in different stages of execution.
</p>


<p>
The feature of an OS to execute multiple programs in inter leaved fashion or different time cycle is known as <b>multiprogramming</b>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: looph0le</p>
<p class="date">Created: 2022-03-01 Tue 13:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
